<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"2376b51fdca65e797ac4bd5b56bf1fc9afa1d700eb4570a28958c3f3ef3fa2d1","plan_job_ref":"Job Run Terraform plan in staging #207 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/13811398469","plan_out_hash":"6a5bfb67f8887093864158aa85fdf3e763f96e68d052db8b7a068f9a1f63703e","plan_hash":"d93f6de1755681049097014fcdde43de9473a4e45072025459b79e161d8100b3","plan_text_format":"diff","version":"1.47.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudfoundry_app.app will be updated in-place
!~  resource "cloudfoundry_app" "app" {
!~      created_at                  = "2024-12-26T21:38:47Z" -> (known after apply)
+       disk_quota                  = (known after apply)
+       health_check_type           = (known after apply)
!~      id                          = "************************************" -> (known after apply)
+       instances                   = (known after apply)
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = (known after apply)
        name                        = "continuous_monitoring-staging"
+       readiness_health_check_type = (known after apply)
!~      source_code_hash            = "zdbokrUq6S7xLIdBt/vXkhWtJUzj37XZQ6qJXM73FRs=" -> "0YFo37VHLzXs7uy654+72fTOS/uywPtbE+BmURMLim4="
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-03-12T12:25:50Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # cloudfoundry_network_policy.egress_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "egress_routing" {
        id = "05a74ebf-eccc-3593-abce-90c94c007b39"

-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "8080" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
+       policy {
+           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5"
+           port            = "8080"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #207](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/13811398469)